{
  "description": "Me especializo en el desarrollo web: desde interfaces hasta plataformas expresivas y funcionales. Siempre buscando la excelencia, comprometido con entregar resultados de calidad.",
  "categories": [
    {
      "category": "Apps y Plataformas Web",
      "description": "Soluciones web multiplataforma que se adapten a sus necesidades específicas. Desde planificación, documentación y desarrollo hasta la implementación y mantenimiento, mi compromiso es brindarle la mejor plataforma web que maximizará la productividad y gestión de su empresa.",
      "projects": [
        {
          "title": "VetCore Pro",
          "technologies_used": [ 2, 3, 8, 4, 25, 5, 11, 7, 12, 18, 20],
          "short_description": "Sistema para la gestión de clínicas veterinarias, optimiza el control de clientes, mascotas, empresas, citas e inventario. Trabajé colaborativamente con SCRUM, participando en la arquitectura de base de datos y el diseño UI/UX. Implementé una API RESTful, gestioné roles y permisos con middleware, y mejoré la mantenibilidad y escalabilidad con componentes reutilizables, y más.",
          "disciplines_covered": [
            "Desarrollo FrontEnd",
            "Desarrollo BackEnd",
            "Diseño de Interfaces (UI/UX)",
            "Arquitectura de Bases de Datos"
          ],
          "large_description": "Desarrollé una aplicación web robusta utilizando Laravel y Vue.js, implementando módulos como autenticación de usuarios, gestión avanzada de roles y permisos, y un sistema de notificaciones en tiempo real. Superé retos como la optimización de consultas complejas en el backend para mejorar el rendimiento y la integración fluida entre frontend y backend. Trabajé estrechamente con mi equipo para garantizar una implementación eficiente y escalable, contribuyendo con soluciones estratégicas a problemas técnicos. A través de la colaboración, logramos un producto final que no solo cumple con los requisitos del cliente, sino que también mejora la experiencia del usuario.",
          "images": [
            {
              "id": 1,
              "path": "/assets/img/projects/veterinary/1.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            },
            {
              "id": 2,
              "path": "/assets/img/projects/veterinary/2.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            },
            {
              "id": 3,
              "path": "/assets/img/projects/veterinary/3.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            }
          ],
          "secondary_technologies": [
            "Framer Motion",
            "react-tooltip",
            "react-router-dom",
            "react-mailchimp-subscribe",
            "i18next",
            "nodemailer",
            "cors",
            "dotenv"
          ]
        },
        {
          "title": "SmartOrder",
          "technologies_used": [ 1, 2, 9, 4, 5, 11, 18, 7, 12 ],
          "short_description": "Sistema de pedidos y gestión para restaurantes con acceso diferenciado según privilegios. Los clientes pueden seleccionar productos, gestionar su carrito y realizar pedidos, mientras que los empleados administran órdenes en tiempo real y pueden marcar compras como completadas o deshabilitar productos del catálogo.",
          "disciplines_covered": [
            "Desarrollo FrontEnd",
            "Desarrollo BackEnd",
            "Diseño de Interfaces (UI/UX)",
            "Arquitectura de Bases de Datos"
          ],
          "large_description": "Sistema consistente distintos modulos segun los permisos de administración de la cuenta tras iniciar sesión se redirige autoamticamente al usuario segun su nivel de privilegios: 1. Menú de selección de productos donde se muestran los productos con existencias agregados por los administradores de la cafeteria y los clientes pueden seleccionarlos, elegir la cantidad a comprar y agregarlos al carrito donde se muestran los productos comprados por el cliente, y se calcula el costo total de la compra, es posible editar y elimnar productos del carrito, finalmente el usuario puede realizar su orden  y se cierra sesión. 2. Modulo de empleados, desde donde se enlistan las ordenes de compra realizadas hasta ahora de los clientes mostrando sus detalles, estas pueden ser marcadas como completadas y se ocultan de la vista. Tambien hay una sección para deshabilitar productos de la lista de productos lo cual los oculta del menu donde los clientes podrian haberlos elegido.",
          "images": [
            {
              "id": 1,
              "path": "/assets/img/projects/coffee-shop/1.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            },
            {
              "id": 2,
              "path": "/assets/img/projects/coffee-shop/2.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            },
            {
              "id": 3,
              "path": "/assets/img/projects/coffee-shop/3.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            }
          ],
          "secondary_technologies": [
            "Framer Motion",
            "react-tooltip",
            "react-router-dom",
            "react-mailchimp-subscribe",
            "i18next",
            "nodemailer",
            "cors",
            "dotenv"
          ]
        },
        {
          "title": "JobMatch",
          "technologies_used": [ 2, 24, 25, 9, 23, 5, 11, 7, 12, 18 ],
          "short_description": "Plataforma web de reclutamiento y postulación laboral, donde recruiters pueden gestionar y publicar vacantes, y desarrolladores pueden postularse con su CV en PDF. Incorpora un sistema de búsqueda avanzada por nombre, categoría y salario, notificaciones en tiempo real y confirmación de cuenta por correo. Diseñada para optimizar el proceso de contratación con eficiencia y usabilidad.",
          "disciplines_covered": [
            "Desarrollo FrontEnd",
            "Desarrollo BackEnd",
            "Diseño de Interfaces (UI/UX)",
            "Arquitectura de Bases de Datos"
          ],
          "large_description": "Plataforma de reclutamiento y postulación a empleos. Registro como recruiter o como desarrollador, los recruiters pueden crear y publicar vacantes y los desarrolladores pueden aplicarse a ellas. Se agregó un sistema de busqueda de vacantes que permite filtrar por nombre, categoría y salario mensual. Envio de correo de confirmación de cuenta tras registro. Sistema de notificaciones cuando un desarrollador se postula a una vacante. Los desarrolladores pueden subir su cv en un archivo pdf cuando se postulan a una vacante.",
          "images": [
            {
              "id": 1,
              "path": "/assets/img/projects/job-vacancies/1.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            },
            {
              "id": 2,
              "path": "/assets/img/projects/job-vacancies/2.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            },
            {
              "id": 3,
              "path": "/assets/img/projects/job-vacancies/3.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            }
          ],
          "secondary_technologies": [
            "Framer Motion",
            "react-tooltip",
            "react-router-dom",
            "react-mailchimp-subscribe",
            "i18next",
            "nodemailer",
            "cors",
            "dotenv"
          ]
        },
        {
          "title": "PicConnect",
          "technologies_used": [ 2, 24, 25, 9, 5, 11, 7, 12, 18],
          "short_description": "Red social para compartir imágenes, con creaión de url dinámicas para perfiles, publicación de posts, sistema de seguidores y likes. Permite subir imágenes, comentar publicaciones y personalizar el perfil con foto. Incluye un feed interactivo que muestra contenido de usuarios seguidos, optimizando la experiencia de interacción y descubrimiento.",
          "disciplines_covered": [
            "Desarrollo FrontEnd",
            "Desarrollo BackEnd",
            "Diseño de Interfaces (UI/UX)",
            "Arquitectura de Bases de Datos"
          ],
          "large_description": "Red Social de Publicación de Imágenes, creación dinamica de url para perfiles de ususario, publicación de posts, subida de imagenes, sistema de seguidores, seguidos, likes y contador de estos, publicación de comentarios en posts, sistema de muestra de publicaciones de usuarios a los que se sigue, cambio de foto de perfil.",
          "images": [
            {
              "id": 1,
              "path": "/assets/img/projects/upload-images/1.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            },
            {
              "id": 2,
              "path": "/assets/img/projects/upload-images/2.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            },
            {
              "id": 3,
              "path": "/assets/img/projects/upload-images/3.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            }
          ],
          "secondary_technologies": [
            "Framer Motion",
            "react-tooltip",
            "react-router-dom",
            "react-mailchimp-subscribe",
            "i18next",
            "nodemailer",
            "cors",
            "dotenv"
          ]
        },
        {
          "title": "EduLink",
          "technologies_used": [ 2, 3, 11, 4, 5, 12, 7, 18],
          "short_description": "Plataforma de tutorías en línea integrada con Zoom, diseñada para ofrecer un aprendizaje accesible y colaborativo. Permite a estudiantes y tutores gestionar, filtrar y participar en tutorías de manera eficiente. Automatiza la creación de videollamadas y la gestión de solicitudes, mientras los profesores validan la aprobación de nuevos tutores.",
          "disciplines_covered": [
            "Desarrollo FrontEnd",
            "Desarrollo BackEnd",
            "Diseño de Interfaces (UI/UX)",
            "Arquitectura de Bases de Datos"
          ],
          "large_description": "Plataforma de tutorías en línea con integración a API de Zoom. ofrece herramientas para que estudiantes y tutores puedan acceder a tutorías de manera eficiente y accesible, buscando enriquecer el proceso de aprendizaje de los estudiantes, con un enfoque de enseñanza comodo  que promueve la cercania y colaboración entre alumnos. Automatiza la creación de reuniones de videollamadas y la gestion de solicitudes de las mismas. Permite a alumnos y profesores gestionar y filtrar tutorías, los alumnos pueden crear o inscribirse en tutorias. Al crear una tutoría se genera automáticamente una videollamada de Zoom con los datos proporcionados por el alumno. Los profesores administran las solicitudes para impartir tutorias de cada alumno y deciden su aprobación o rechazo.",
          "images": [
            {
              "id": 1,
              "path": "/assets/img/projects/school-tutoring/1.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            },
            {
              "id": 2,
              "path": "/assets/img/projects/school-tutoring/2.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            },
            {
              "id": 3,
              "path": "/assets/img/projects/school-tutoring/3.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            }
          ],
          "secondary_technologies": [
            "Framer Motion",
            "react-tooltip",
            "react-router-dom",
            "react-mailchimp-subscribe",
            "i18next",
            "nodemailer",
            "cors",
            "dotenv"
          ]
        },
        {
          "title": "DASC UABCS",
          "technologies_used": [ 10, 5, 4, 12, 7],
          "short_description": "Sitio web informativo para el Departamento de Sistemas Computacionales de la UABCS. Optimiza la gestión de contenidos, reduciendo la carga de trabajo de profesores y mejorando el acceso a información clave para estudiantes. Incluye herramientas de accesibilidad, diseño supervisado por docentes y desarrollo a medida con integraciones optimizadas.",
          "disciplines_covered": [
            "Desarrollo FrontEnd",
            "Desarrollo BackEnd",
            "Diseño de Interfaces (UI/UX)",
            "Arquitectura de Bases de Datos"
          ],
          "large_description": "Sitio web informativo para el Departamento de Sistemas Computacionales (DASC) de la Universidad Autónoma de Baja California Sur (UABCS). El proyecto se redujo la carga de trabajo de los profesores, simplificando el proceso de actualización de contenidos de forma visual, rapida e intuitiva y se mejoro la experiencia de los estudiantes brindandoles un acceso eficiente a la información relevante. El sitio ofrece información completa sobre el catalogo de carreras, actividades, horarios, contactos, noticias y enlaces de interes, así como ofrece herramientas de accesibilidad para personas especiales. Se Trabajo colaborativamente. Se realizó el diseño completamente bajo supervición de los profesores. Se implementaron funcionalidades programadas a medidas de las necesidades del departamento así como se integraron algunos plugins para optimizar el flujo de desarrollo.",
          "images": [
            {
              "id": 1,
              "path": "/assets/img/projects/dasc-uabcs/1.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            },
            {
              "id": 2,
              "path": "/assets/img/projects/dasc-uabcs/2.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            },
            {
              "id": 3,
              "path": "/assets/img/projects/dasc-uabcs/3.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            }
          ],
          "secondary_technologies": [
            "Framer Motion",
            "react-tooltip",
            "react-router-dom",
            "react-mailchimp-subscribe",
            "i18next",
            "nodemailer",
            "cors",
            "dotenv"
          ]
        },
        {
          "title": "LearnPlay",
          "technologies_used": [ 5, 4, 12, 7, 18],
          "short_description": "Sitio web educativo para niños de primaria, ofrece una experiencia de aprendizaje interactiva y divertida mediante tres mini-juegos centrados en operaciones matemáticas básicas, reconocimiento de patrones y lectura de reloj analógico. Implementa sistema de vidas, desbloqueo de niveles con localStorage, optimización con componentes reutilizables y carga dinámica de datos desde archivos JSON.",
          "disciplines_covered": [
            "Desarrollo FrontEnd",
            "Desarrollo BackEnd",
            "Diseño de Interfaces (UI/UX)",
            "Arquitectura de Bases de Datos"
          ],
          "large_description": "Sitio web de videojuegos educativos para niños de primaria, brinda a los niños una experiencia accesible, divertida y educativa con tres mini-juegos enfocados en el aprendizaje de operaciones básicas como suma, resta, reconocimiento de patrones, secuencias numéricas y lectura de un reloj analógico. Sistema de vidas almacenado en localStorage que resta vidas al cometer errores, sistema de desbloqueo de niveles con aumento de dificultad, uso de componentes reutilizables y carga de información renderizada desde archivos json para evitar repeticion de código.",
          "images": [
            {
              "id": 1,
              "path": "/assets/img/projects/educational-games/1.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            },
            {
              "id": 2,
              "path": "/assets/img/projects/educational-games/2.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            },
            {
              "id": 3,
              "path": "/assets/img/projects/educational-games/3.png",
              "alt": "Panel Administrativo Veterinaria",
              "caption": "Panel Administrativo Veterinaria"
            }
          ],
          "secondary_technologies": [
            "Framer Motion",
            "react-tooltip",
            "react-router-dom",
            "react-mailchimp-subscribe",
            "i18next",
            "nodemailer",
            "cors",
            "dotenv"
          ]
        }
      ]
    },
    {
      "category": "Diseño de Interfaces",
      "description": "Diseño de interfaces de usuario atractivas y funcionales. Mi objetivo es brindar a los usuarios una experiencia cómoda pero memorable.",
      "projects": [
        {
          "title": "Business Startup",
          "description": "Design & Development",
          "imgPath": ""
        }
      ]
    },
    {
      "category": "Contribuciones a Comunidad",
      "description": "Contribuyo a la comunidad mediante proyectos de código abierto y participación activa en la creación de contenido. Mi objetivo es compartir experiencia y conocimientos mientras me sumerjo aún más en mis áreas de dominio.",
      "projects": [
        {
          "title": "Business Startup",
          "description": "Design & Development",
          "imgPath": ""
        }
      ]
    }
  ]
}